package com.deppon.fssc.module.quartz.common.demo;

/**
 * 
 * <pre>
 * 功能:测试用demo
 * 作者：谢玉良
 * 日期：2013-4-12下午9:28:58
 * </pre>
 */
public class test {
	/**
	 * <pre>
	 * 方法体说明：测试方法1，供进行任务动态配置时的方法测试
	 * 作者：谢玉良
	 * 日期： 2013-7-25 上午10:46:56
	 * </pre>
	 */
	public void test1() {
		// 方法开始
		System.out.println("动态添加的QUARTZ:test1");
		// 方法结束
	}

	/**
	 * <pre>
	 * 方法体说明：测试方法1，供进行任务动态配置时的方法测试
	 * 作者：谢玉良
	 * 日期： 2013-7-25 上午10:46:53
	 * </pre>
	 */
	public void test2() {
		// 方法开始
		System.out.println("动态添加的QUARTZ:test2");
		// 方法结束
	}

	/**
	 * <pre>
	 * 方法体说明：测试方法1，供进行任务动态配置时的方法测试
	 * 作者：谢玉良
	 * 日期： 2013-7-25 上午10:46:59
	 * </pre>
	 */
	public void test3() {
		// 方法开始
		System.out.println("***************test3");
		// 方法结束
	}

	/**
	 * <pre>
	 * 方法体说明：测试方法1，供进行任务动态配置时的方法测试
	 * 作者：谢玉良
	 * 日期： 2013-7-25 上午10:46:59
	 * </pre>
	 */
	public void test4() {
		// 方法开始
		System.out.println("***************test4");
		// 方法结束
	}

	/**
	 * <pre>
	 * 方法体说明：测试方法1，供进行任务动态配置时的方法测试
	 * 作者：谢玉良
	 * 日期： 2013-7-25 上午10:46:59
	 * </pre>
	 */
	public void test5() {
		// 方法开始
		System.out.println("***************test5");
		// 方法结束
	}

	/**
	 * <pre>
	 * 方法体说明：测试方法1，供进行任务动态配置时的方法测试
	 * 作者：谢玉良
	 * 日期： 2013-7-25 上午10:46:59
	 * </pre>
	 */
	public void test6() {
		// 方法开始
		System.out.println("***************test6");
		// 方法结束
	}

	/**
	 * <pre>
	 * 方法体说明：测试方法1，供进行任务动态配置时的方法测试
	 * 作者：谢玉良
	 * 日期： 2013-7-25 上午10:46:59
	 * </pre>
	 */
	public void test7() {
		// 方法开始
		System.out.println("***************test7");
		// 方法结束
	}

	/**
	 * <pre>
	 * 方法体说明：测试方法1，供进行任务动态配置时的方法测试
	 * 作者：谢玉良
	 * 日期： 2013-7-25 上午10:46:59
	 * </pre>
	 */
	public void test8() {
		// 方法开始
		System.out.println("***************test8");
		// 方法结束
	}

	/**
	 * <pre>
	 * 方法体说明：测试方法1，供进行任务动态配置时的方法测试
	 * 作者：谢玉良
	 * 日期： 2013-7-25 上午10:46:59
	 * </pre>
	 */
	public void test9() {
		// 方法开始
		System.out.println("***************test9");
		// 方法结束
	}

	/**
	 * <pre>
	 * 方法体说明：测试方法1，供进行任务动态配置时的方法测试
	 * 作者：谢玉良
	 * 日期： 2013-7-25 上午10:46:59
	 * </pre>
	 */
	public void test10() {
		// 方法开始
		System.out.println("***************test10");
		// 方法结束
	}

	/**
	 * <pre>
	 * 方法体说明：测试方法1，供进行任务动态配置时的方法测试
	 * 作者：谢玉良
	 * 日期： 2013-7-25 上午10:46:59
	 * </pre>
	 */
	public void test11() {
		// 方法开始
		System.out.println("***************test11");
		// 方法结束
	}

	/**
	 * <pre>
	 * 方法体说明：测试方法1，供进行任务动态配置时的方法测试
	 * 作者：谢玉良
	 * 日期： 2013-7-25 上午10:46:59
	 * </pre>
	 */
	public void test12() {
		// 方法开始
		System.out.println("***************test12");
		// 方法结束
	}

	/**
	 * <pre>
	 * 方法体说明：测试方法1，供进行任务动态配置时的方法测试
	 * 作者：谢玉良
	 * 日期： 2013-7-25 上午10:46:59
	 * </pre>
	 */
	public void test13() {
		// 方法开始
		System.out.println("***************test13");
		// 方法结束
	}

	/**
	 * <pre>
	 * 方法体说明：测试方法1，供进行任务动态配置时的方法测试
	 * 作者：谢玉良
	 * 日期： 2013-7-25 上午10:46:59
	 * </pre>
	 */
	public void test14() {
		// 方法开始
		System.out.println("***************test14");
		// 方法结束
	}
}
